In [5]:
import numpy as np
import pandas as pd

In [13]:
file = '/home/julien/Desktop/DATASET/movie_scores.csv'

In [14]:
df = pd.read_csv(file)

## données manquantes

une nouvelle valeur `pd.NA` (singleton) repesente les valeur manquantes scalaires

In [11]:
np.nan, pd.NA, pd.NaT

(nan, <NA>, NaT)

In [24]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [32]:
df[ df['first_name'].notnull() ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

## valeur abérante

`valeur manquante`

In [37]:
df[ (df['pre_movie_score'].isnull()) & (df['sex'].notnull()) ]

#f = lambda r: r['pre_movie_score'].isnull() and r['sex'].notnull()

#df[ df.apply(f, axis=1)]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [46]:
df.dropna(thresh=4, axis=1)

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

## df.fillna

In [61]:
df['first_name'] = df['first_name'].fillna('Call me now baby')

In [66]:
df

,first_name,last_name,age,sex,pre_movie_score,post_movie_score,fist_name
0,Tom,Hanks,63.0,m,8.0,10.0,Tom
1,Not a name pls,NaN,NaN,NaN,NaN,NaN,Not a name pls
2,Hugh,Jackman,51.0,m,NaN,NaN,Hugh
3,Oprah,Winfrey,66.0,f,6.0,8.0,Oprah
4,Emma,Stone,31.0,f,7.0,9.0,Emma

In [68]:
pmean = df['pre_movie_score'].mean()

In [70]:
df['pre_movie_score'] = df['pre_movie_score'].fillna(pmean)
df

,first_name,last_name,age,sex,pre_movie_score,post_movie_score,fist_name
0,Tom,Hanks,63.0,m,8.0,10.0,Tom
1,Not a name pls,NaN,NaN,NaN,7.0,NaN,Not a name pls
2,Hugh,Jackman,51.0,m,7.0,NaN,Hugh
3,Oprah,Winfrey,66.0,f,6.0,8.0,Oprah
4,Emma,Stone,31.0,f,7.0,9.0,Emma

In [73]:
after_change = df['pre_movie_score'].mean()
after_change == pmean

True